package ru.javabegin.training.test_pattern;

import java.text.ParseException;
import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;
import java.util.regex.Pattern;

public class test_pattern_VisitFile {


    public static void main(String[] args) throws ParseException {



        String d1="01/03/18|72.24 |59.12 |13.12 |362.60|354.13 | 0.00 | 0.00  | 0.00 |354.13 | 4.20 | 2.40 |22.023 |17.348 | 24 | 0  |  |  |  |  |  |  |  |  |  |  |  |  |  |";
        String d2="01/03/18|72.24 |59.12 |13.12 |362.60|354.13 | 0.00 | 0.00  | 0.00 |354.13 | 4.20 | 2.40 |22.023 |17.348 | 24 | 0  |  |  |  |  |  |  |  |  |  |  |  |  |  |";
        String d3="02/03/18|72.91 |61.23 |11.68 |333.80|325.90 | 0.00 | 0.00  | 0.00 |325.90 | 4.20 | 2.40 |20.484 |16.662 | 24 | 0  |  |  |  |  |  |  |  |  |  |  |  |  |  |";
        String d4="03/03/18|72.53 |61.16 |11.37 |353.30|344.99 | 0.00 | 0.00  | 0.00 |344.99 | 4.20 | 2.40 |21.553 |17.598 | 24 | 0  |  |  |  |  |  |  |  |  |  |  |  |  |  |";
        String d5="04/03/18|73.06 |62.92 |10.14 |363.40|354.74 | 0.40 | 0.39  | 0.00 |354.35 | 4.20 | 2.40 |22.329 |18.410 | 24 | 0  |  |  |  |  |  |  |  |  |  |  |  |  |  |";
        String d6="05/03/18|71.82 |45.88 |25.94 |327.30|319.71 | 2.30 | 2.28  | 0.00 |317.43 | 4.20 | 2.40 |19.663 |15.856 | 24 | 0  |  |  |  |  |  |  |  |  |  |  |  |  |  |";
        String d7="06/03/18|74.92 |63.50 |11.42 |346.10|337.47 | 0.00 | 0.00  | 0.00 |337.47 | 4.20 | 2.40 |21.891 |18.023 | 24 | 0  |  |  |  |  |  |  |  |  |  |  |  |  |  |";
        String d8="07/03/18|72.56 |63.50 | 9.06 |292.30|285.42 | 1.30 | 1.27  | 0.00 |284.15 | 4.20 | 2.40 |17.773 |14.727 | 24 | 0  |  |  |  |  |  |  |  |  |  |  |  |  |  |";
        String d9="08/03/18|69.85 |59.72 |10.13 |317.30|310.34 | 0.00 | 0.00  | 0.00 |310.34 | 4.20 | 2.40 |18.558 |15.414 | 24 | 0  |  |  |  |  |  |  |  |  |  |  |  |  |  |";
        String d10="Итого: |      |      |      |4431.9|4329.27| 4.50 | 4.43  | 0.00 |4324.84|      |      |267.571|211.738|312 | 0  |";
        String d11="        __________________________________________________________________________________________________________________________________________________________";
        String d12="Средние:|71.87 |58.30 |13.57 |      |       |      |       |      |       | 4.20 | 2.40 |       |       |    |    |";
        String d13="__________________________________________________________________________________________________________________________________________________________";
        String d14="28/02/18 24:00|55092.80 | 53889.83 | 437.50  |  430.00  |  0.00   | 53459.83 | 3180.629 | 2439.735 | 3683  |   0   |";



        List<String> l=new ArrayList<>();
        l.add(d1);
        l.add(d2);
        l.add(d3);
        l.add(d4);
        l.add(d5);
        l.add(d6);
        l.add(d7);
        l.add(d8);
        l.add(d9);
        l.add(d10);
        l.add(d11);
        l.add(d12);
        l.add(d13);
        l.add(d14);





        for (String d:l) {
            //System.out.println(d);

        d=d.replace(" ","");
        List<String> list = new ArrayList<>(Arrays.asList(d.split("\\|")));
        //list.forEach(p->System.out.print(p+" "));
        System.out.println();

            String regularExpression="\\d{2}/\\d{2}/\\d{2}\\z";
            String regularExpression1="\\d{2}/\\d{2}/\\d{2}24:00";
        for (String s:list) {

            if (Pattern.compile(regularExpression).matcher(s).find()) {
                System.out.println("найдено day = " + s);

            }
            if (Pattern.compile(regularExpression1).matcher(s).find()) {
                System.out.println("найдено month = " + s);

            }
        }


        }

    }

}
